<a href="https://colab.research.google.com/github/Shane-a-na/bins/blob/master/3a_Exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 3 Exercises Data Manipulation

## Task - understanding libraries and cells
Put the following into your own words;\
NB - import libraries only need to be declared once in a notebook, these example repeat the import for explanatory purposes.\
NB - you dont have to keep declaring the array in every cell, these examples repeat the declaration for explanatory purposes\
NB - the values assigned to variables persist from cell to cell unless overwritten

## Task - data cleansing

#Completed
Read in the demo3.csv data set, display shape, remove the row(s) with NaN values and display shape again

In [62]:
import pandas as pd

# Read the data from a CSV file
data = pd.read_csv('demo3.csv')

print(data.shape)

# Remove missing values
data = data.dropna()

print(data.shape)

(5, 2)
(4, 2)

In [63]:
import pandas as pd

df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
print(df)
print("dropped")
print(df.dropna())

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6
dropped
     0    1  2
1  2.0  3.0  5

## Task - add a column

#Completed
**add a column** to a demo1.csv dataframe which categories salary as less than, equal to or greater than 50k

In [64]:
# Read the CSV file into a DataFrame
df = pd.read_csv('demo1.csv')

# Create a new column 'Salary Group' based on salary
df['Salary Group'] = ['Under 55k' if Salary < 55000 else 'Over 55k' if Salary > 55000 else 'Equal to 50k' for Salary in df['Salary']]

# Print the DataFrame with the new column
print(df)

      Name  Age      City  Salary Department  Salary Group
0     John   25  New York   50000         HR     Under 55k
1     Emir   28    London   60000  Marketing      Over 55k
2    Peter   32     Paris   70000         HR      Over 55k
3   Olivia   30     Delhi   55000  Marketing  Equal to 50k
4  Jackson   27  New York   65000         HR      Over 55k

## Task - total of column

#Completed
get a **total** of the salary column

In [ ]:
# Read the CSV file into a DataFrame
df = pd.read_csv('demo1.csv')

# Calculate the total of 'Salary' column
total_salary = df['Salary'].sum()

# Print the total salary
print("Total Salary:", total_salary)

## Task - concatenate

#Completed
Read in files demo1.csv and demo2.csv to two separate dataframes. Concatenate the two dataframes vertically and display the result.

In [65]:
# Read the CSV files into 2 DataFrames
df1 = pd.read_csv('demo1.csv')
df2 = pd.read_csv('demo2.csv')

# Concatenate the DataFrames vertically
result = pd.concat([df1, df2], axis=1)

print(result)

      Name  Age      City  Salary Department     Name           Title
0     John   25  New York   50000         HR     John   Sales Advisor
1     Emir   28    London   60000  Marketing     Emir      Accountant
2    Peter   32     Paris   70000         HR    Peter  Data Scientist
3   Olivia   30     Delhi   55000  Marketing   Olivia      Accountant
4  Jackson   27  New York   65000         HR  Jackson   Sales Advisor

## Task - merge

#Completed
Read in files demo1.csv and demo2.csv to two separate dataframes. merge the two dataframes vertically and display the result./
Compare the result with the previous task.

In [66]:
# Read the CSV files into 2 DataFrames
df1 = pd.read_csv('demo1.csv')
df2 = pd.read_csv('demo2.csv')

#merge the dataframes
df3 = pd.merge(df1, df2)

print(df3)

      Name  Age      City  Salary Department           Title
0     John   25  New York   50000         HR   Sales Advisor
1     Emir   28    London   60000  Marketing      Accountant
2    Peter   32     Paris   70000         HR  Data Scientist
3   Olivia   30     Delhi   55000  Marketing      Accountant
4  Jackson   27  New York   65000         HR   Sales Advisor

## Task - crosstab

#Completed
Read the crosstab example which uses a basic manually created data set which has columns related to the titanic data set. Load the titanic data set and 'create' cross tabs using pclass and alive, first for the number then secondly for the percentage

In [67]:
import seaborn as sns

# Load the titanic dataset from seaborn
df = sns.load_dataset('titanic')

# Perform a cross-tabulation of 'Sex' and 'Survived'
sex_survived_cross = pd.crosstab(df['sex'], df['survived'])
print(sex_survived_cross)
print()

#Perform cross-tab with percentage
sex_survived_cross_percent = pd.crosstab(df['sex'], df['survived'], normalize='index') * 100
print(sex_survived_cross_percent)

survived    0    1
sex
female     81  233
male      468  109

survived          0          1
sex
female    25.796178  74.203822
male      81.109185  18.890815

## Task - **groupby**

#Completed
groupby the demo1.csv file data by 'City'

In [68]:
# Read the CSV file into a DataFrame
df = pd.read_csv('demo1.csv')

# Group the DataFrame by 'City' column
grouped_df = df.groupby('City')

# Iterate over the groups and print the group name and corresponding data
for city, city_data in grouped_df:
    print("City:", city)
    print(city_data)
    print()

City: Delhi
     Name  Age   City  Salary Department
3  Olivia   30  Delhi   55000  Marketing

City: London
   Name  Age    City  Salary Department
1  Emir   28  London   60000  Marketing

City: New York
      Name  Age      City  Salary Department
0     John   25  New York   50000         HR
4  Jackson   27  New York   65000         HR

City: Paris
    Name  Age   City  Salary Department
2  Peter   32  Paris   70000         HR

## Task - pivot table

#Completed
Create a **pivot table** with 'City' as index, 'Salary' as values and aggfunc as mean

In [69]:
# Read the CSV file into a DataFrame
df = pd.read_csv('demo1.csv')

# Create a pivot table with 'City' as index, 'Salary' as values and aggfunc as mean
pivot = df.pivot_table(
    values= 'Salary',
    index= 'City',
    columns=None,
    aggfunc='mean',
    fill_value=None,
    margins=False,
    dropna=True,
    margins_name='All',
    observed=False
)

# Print the pivot table
print(pivot)

          Salary
City
Delhi      55000
London     60000
New York   57500
Paris      70000

## Task - write to a file

#Completed
write out to a file the df example with salary groups

In [70]:
# Read the CSV file into a DataFrame
df = pd.read_csv('demo1.csv')

# Create a new column 'Salary Group' based on age condition
df['Salary Group'] = ['Under 55k' if Salary < 55000 else 'Over 55k' if Salary > 55000 else 'Equal to 50k' for Salary in df['Salary']]

# Print the DataFrame with the new column
print(df)

# Write the DataFrame to a CSV file
df.to_csv('output.csv', index=True)

      Name  Age      City  Salary Department  Salary Group
0     John   25  New York   50000         HR     Under 55k
1     Emir   28    London   60000  Marketing      Over 55k
2    Peter   32     Paris   70000         HR      Over 55k
3   Olivia   30     Delhi   55000  Marketing  Equal to 50k
4  Jackson   27  New York   65000         HR      Over 55k